Repository: FernandoNv/hello-client
Catalog: src/locale/messages.*.xlf
Languages: pt

source: Create a New Client
pt: Criar Novo Cliente

source: Client: <span>{{ client()!.name }}</span>
pt: Cliente: <span>{{ client()!.name }}</span>

source: The name is required
pt: O nome é obrigatório

source: The name must contain at least 3 characters
pt: O nome deve conter no mínimo 3 caracteres

source: The name must contain a maximum of 255 characters
pt: O nome deve conter no máximo 255 caracteres

source: The name must have a valid value. Ex: Fulano da Silva
pt: O nome deve ter um valor válido. Ex: Fulano da Silva

source: The e-mail is required
pt: O e-mail é obrigatório

source: The e-mail must have a valid value. Ex: email@email.com
pt: O e-mail deve ter um valor válido. Ex: email@email.com

source: The e-mail is already taken.
pt: Este e-mail já está em uso.

source: The phone is required
pt: O telefone é obrigatório

source: The phone must have a valid value
pt: O telefone deve ter um valor válido

source: Zip Code
pt: CEP

source: The zip code is required
pt: O CEP é obrigatório

source: The zip code must be a valid value. Ex: 99999-999
pt: O CEP deve ter um valor válido. Ex: 99999-999

source: Invalid zip code. Try again.
pt: CEP inválido. Tente novamente.

source: State
pt: Estado

source: The state is required
pt: O estado é obrigatório

source: The state must contain at least 2 characters
pt: O estado deve conter no mínimo 2 caracteres

source: The state must contain a maximum of 2 characters
pt: O estado deve conter no máximo 2 caracteres

source: City
pt: Cidade

source: The city is required
pt: A cidade é obrigatória

source: The city must contain at least 3 characters
pt: A cidade deve conter no mínimo 3 caracteres

source: The city must contain a maximum of 255 characters
pt: A cidade deve conter no máximo 255 caracteres

source: The city must have a valid value. Ex: Rio de Janeiro
pt: A cidade deve ter um valor válido. Ex: Rio de Janeiro

source: Street
pt: Rua

source: The street is required
pt: A rua é obrigatória

source: The street must contain at least 3 characters
pt: A rua deve conter no mínimo 3 caracteres

source: The street must contain a maximum of 255 characters
pt: A rua deve conter no máximo 255 caracteres

source: The street must have a valid value
pt: A rua deve ter um valor válido

source: Clients
pt: Clientes

source: Number
pt: Número

source: The number is required
pt: O número é obrigatório

source: Min 1
pt: Mínimo 1

source: 10000 max
pt: Máximo 10000

source: Number only
pt: Apenas números

source: Name
pt: Nome

source: Phone
pt: Telefone

source: Action
pt: Ação

source: Menu Options
pt: Opções do Menu
